Revit 2024 API
AnalyticalOpening.Create Method
 Creates a new instance of an Analytical Opening within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static AnalyticalOpening Create(
	Document aDoc,
	CurveLoop curveLoop,
	ElementId panelId
)
Visual Basic
Public Shared Function Create ( _
	aDoc As Document, _
	curveLoop As CurveLoop, _
	panelId As ElementId _
) As AnalyticalOpening
Visual C++
public:
static AnalyticalOpening^ Create(
	Document^ aDoc,
	CurveLoop^ curveLoop,
	ElementId^ panelId
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 Revit document.
curveLoop
Type: Autodesk.Revit.DB.CurveLoop
 CurveLoop for the Analytical Opening.
panelId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the AnalyticalPanel on which we create the Opening.
Return Value
 The newly created AnalyticalOpening instance.
Remarks
 CurveLoop must be planar, not self-intersecting and in the same plane as the Analytical Panel. CurveLoop must intersect or to be inside the AnalyticalPanel contour. PanelId must be the ElementId of an AnalyticalPanel otherwise an exception is thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  One of the following requirements is not satisfied : - curve loop curveLoop is not planar - curve loop curveLoop is self-intersecting - curve loop curveLoop contains zero length curves - curve loop curveLoop is not inside or does not intersect the AnalyticalPanel on which we want to create the Opening. - panelId is not the ElementId of an AnalyticalPanel - curve loop curveLoop is not in the same plane as the Analytical Panel
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace